aberzen/section-robotique-ce-astrium/autopilot/ext-lib/FreeRTOS_extension/portable/GCC/ATMega2560/port.c
void vPortEndScheduler( void )
{
	/* It is unlikely that the AVR port will get stopped.  If required simply
	disable the tick interrupt here. */
}
/*-----------------------------------------------------------*/

/*
 * Manual context switch.  The first thing we do is save the registers so we
 * can use a naked attribute.
 */
void vPortYield( void ) __attribute__ ( ( naked ) );
void vPortYield( void )
{
	portSAVE_CONTEXT();
	vTaskSwitchContext();
	portRESTORE_CONTEXT();

	asm volatile ( "ret" );
}
/*-----------------------------------------------------------*/

/*
 * Context switch function used by the tick.  This must be identical to 
 * vPortYield() from the call to vTaskSwitchContext() onwards.  The only
 * difference from vPortYield() is the tick count is incremented as the
 * call comes from the tick ISR.
 */
void vPortYieldFromTick( void ) __attribute__ ( ( naked ) );
void vPortYieldFromTick( void )
{
	portSAVE_CONTEXT();
	vTaskIncrementTick();
	vTaskSwitchContext();
	portRESTORE_CONTEXT();

	asm volatile ( "ret" );
}
/*-----------------------------------------------------------*/

void vPortSystemClockEnable( portBASE_TYPE Enable )
{
	portCHAR uc;

#ifndef USE_RTC_TIMER
	uc = TIMSK;
	if ( Enable )
	{
		uc |= portCOMPARE_MATCH_A_INTERRUPT_ENABLE;
	}
	else
	{
		uc &= ~portCOMPARE_MATCH_A_INTERRUPT_ENABLE;
	}
	TIMSK = uc;
#else

#ifdef __ATmegaxx0__
	uc = TIMSK2;
	if ( Enable )
	{
	    // Enable the Output Compare Match A Interrupt
	    uc |= _BV(OCIE2A);
	}
	else
	{
	    // Disable the Output Compare Match A Interrupt
	    uc &= ~_BV(OCIE2A);
	}
	TIMSK2 = uc;
#else
	uc = TIMSK;
	if ( Enable )
	{
		uc |= (1 << OCIE0);
	}
	else
	{
		uc &= ~(1 << OCIE0);
	}
	TIMSK = ucLowByte;
#endif // __ATmegaxx0__

#endif // USE_RTC_TIMER
}
/*-----------------------------------------------------------*/

#ifndef USE_RTC_TIMER
/*
 * Setup timer 1 compare match A to generate a tick interrupt.
 */
static void prvSetupTimerInterrupt( void )
{
unsigned long ulCompareMatch;
//unsigned char ucHighByte, ucLowByte;

	/* Using 16bit timer 1 to generate the tick.  Correct fuses must be
	selected for the configCPU_CLOCK_HZ clock. */

	ulCompareMatch = configCPU_CLOCK_HZ / configTICK_RATE_HZ;

	/* We only have 16 bits so have to scale to get our required tick rate. */
	ulCompareMatch /= portCLOCK_PRESCALER;

	/* Adjust for correct value. */
	ulCompareMatch -= ( unsigned long ) 1;

	/* Setup compare match value for compare match A.  Interrupts are disabled
	before this is called so we need not worry here. */
	OCR1AH = ( unsigned char ) ( (ulCompareMatch >> 8) & 0xff );
	OCR1AL = ( unsigned char ) ( (ulCompareMatch >> 0) & 0xff );

	/* Setup clock source and compare match behaviour. */
//	TCCR1A = 0xC0;
//	TCCR1B = 0x07;
	TCCR1B = portCLEAR_COUNTER_ON_MATCH | portPRESCALE_64;

	/* Enable the interrupt - this is okay as interrupt are currently globally
	disabled. */
	TIMSK |= portCOMPARE_MATCH_A_INTERRUPT_ENABLE;
}

#else

/*
 * Setup Crystal-controlled timer compare match A to generate a tick interrupt.
 */
static void prvSetupTimerInterrupt( void )
{

#ifdef __ATmegaxx0__

	/* ATmega640/1280/2560 uses Timer2 for the real time clock */
	// Disable interrupts
    TIMSK2 = 0;
    // Reset ASSR
	ASSR = 0;
    // Set mode to CTC (WGM22 WGM21 WGM20 = 010)
    TCCR2A = _BV(WGM21) ;
    // Set prescaler of clk/64 <=> (CS22 CS21 CS20 = 100)
    // Set prescaler of clk/256 <=> (CS22 CS21 CS20 = 110)
    TCCR2B = _BV(CS22);
    // Output Compare Registers
    //OCR2A = 249;
    OCR2A = 249;
    OCR2B = 0;
    // Set count to zero, so it goes off right away.
    TCNT2  = 0;
    // clear pending interrupts;
    TIFR2  = _BV(OCF2A);
    // Enable the Output Compare Match A Interrupt
    TIMSK2 = _BV(OCIE2A);

#else
	/* ATmega128 et. al. uses Timer0 for the real time clock */
	TIMSK &= ~( (1 << TOIE0) | (1 << OCIE0) );	// disable timer0 interrupts

	ASSR = (1 << AS0);							// set timer to run from xtal
	TCNT0 = 0x00;								// clear the counter
	TCCR0 = ( (1 << WGM01) | (1 << CS00);		// div. sys clock by 1
	OCR0 = usCompareMatch;

	while ( ASSR & 0x07 );						// wait for timer to be ready

	TIMSK |= (1 << OCIE0);						// interrupt on timer0 compare match

#endif
}

#endif // USE_RTC_TIMER

/*-----------------------------------------------------------*/

//#if configUSE_PREEMPTION == 1
//
//	/*
//	 * Tick ISR for preemptive scheduler.  We can use a naked attribute as
//	 * the context is saved at the start of vPortYieldFromTick().  The tick
//	 * count is incremented after the context is saved.
//	 */
//	ISR( TIMER_COMPARE_SIG, ISR_NAKED ISR_SECTION )
//	{
//		vPortYieldFromTick();
//		asm volatile ( "reti" );
//	}
//#else
//
//	/*
//	 * Tick ISR for the cooperative scheduler.  All this does is increment the
//	 * tick count.  We don't need to switch context, this can only be done by
//	 * manual calls to taskYIELD();
//	 */
//	ISR( TIMER_COMPARE_SIG, ISR_NAKED ISR_SECTION )
//	{
//		vTaskIncrementTick();
//		asm volatile ( "reti" );
//	}
//#endif


#if configUSE_PREEMPTION == 1
#ifndef USE_RTC_TIMER
	/*
	 * Tick ISR for preemptive scheduler.  We can use a naked attribute as
	 * the context is saved at the start of vPortYieldFromTick().  The tick
	 * count is incremented after the context is saved.
	 */
	void SIG_OUTPUT_COMPARE1A( void ) __attribute__ ( ( signal, naked ) );
	void SIG_OUTPUT_COMPARE1A( void )
	{
		vPortYieldFromTick();
		asm volatile ( "reti" );
	}
#else
	/*
	 * Tick ISR for preemptive scheduler.  We can use a naked attribute as
	 * the context is saved at the start of vPortYieldFromTick().  The tick
	 * count is incremented after the context is saved.
	 */
	void SIG_OUTPUT_COMPARE2A( void ) __attribute__ ( ( signal, naked ) );
	void SIG_OUTPUT_COMPARE2A( void )
	{
		vPortYieldFromTick();
		asm volatile ( "reti" );
	}
#endif

#else

	/*
	 * Tick ISR for the cooperative scheduler.  All this does is increment the
	 * tick count.  We don't need to switch context, this can only be done by
	 * manual calls to taskYIELD();
	 */
	void SIG_OUTPUT_COMPARE1A( void ) __attribute__ ( ( signal ) );
	void SIG_OUTPUT_COMPARE1A( void )
	{
		vTaskIncrementTick();
	}
#endif



